GopalSaraf/Practicals/PSDL/include/proc/pic16f707.inc
// Register: TACON
#define TACON TACON
TACON                                    equ 0105h
// bitfield definitions
TACON_TAPS_POSN                          equ 0000h
TACON_TAPS_POSITION                      equ 0000h
TACON_TAPS_SIZE                          equ 0003h
TACON_TAPS_LENGTH                        equ 0003h
TACON_TAPS_MASK                          equ 0007h
TACON_TAPSA_POSN                         equ 0003h
TACON_TAPSA_POSITION                     equ 0003h
TACON_TAPSA_SIZE                         equ 0001h
TACON_TAPSA_LENGTH                       equ 0001h
TACON_TAPSA_MASK                         equ 0008h
TACON_TASE_POSN                          equ 0004h
TACON_TASE_POSITION                      equ 0004h
TACON_TASE_SIZE                          equ 0001h
TACON_TASE_LENGTH                        equ 0001h
TACON_TASE_MASK                          equ 0010h
TACON_TACS_POSN                          equ 0005h
TACON_TACS_POSITION                      equ 0005h
TACON_TACS_SIZE                          equ 0001h
TACON_TACS_LENGTH                        equ 0001h
TACON_TACS_MASK                          equ 0020h
TACON_TMRAON_POSN                        equ 0007h
TACON_TMRAON_POSITION                    equ 0007h
TACON_TMRAON_SIZE                        equ 0001h
TACON_TMRAON_LENGTH                      equ 0001h
TACON_TMRAON_MASK                        equ 0080h
TACON_TAPS0_POSN                         equ 0000h
TACON_TAPS0_POSITION                     equ 0000h
TACON_TAPS0_SIZE                         equ 0001h
TACON_TAPS0_LENGTH                       equ 0001h
TACON_TAPS0_MASK                         equ 0001h
TACON_TAPS1_POSN                         equ 0001h
TACON_TAPS1_POSITION                     equ 0001h
TACON_TAPS1_SIZE                         equ 0001h
TACON_TAPS1_LENGTH                       equ 0001h
TACON_TAPS1_MASK                         equ 0002h
TACON_TAPS2_POSN                         equ 0002h
TACON_TAPS2_POSITION                     equ 0002h
TACON_TAPS2_SIZE                         equ 0001h
TACON_TAPS2_LENGTH                       equ 0001h
TACON_TAPS2_MASK                         equ 0004h
TACON_TMRAPS_POSN                        equ 0000h
TACON_TMRAPS_POSITION                    equ 0000h
TACON_TMRAPS_SIZE                        equ 0003h
TACON_TMRAPS_LENGTH                      equ 0003h
TACON_TMRAPS_MASK                        equ 0007h
TACON_TMRAPSA_POSN                       equ 0003h
TACON_TMRAPSA_POSITION                   equ 0003h
TACON_TMRAPSA_SIZE                       equ 0001h
TACON_TMRAPSA_LENGTH                     equ 0001h
TACON_TMRAPSA_MASK                       equ 0008h
TACON_TMRASE_POSN                        equ 0004h
TACON_TMRASE_POSITION                    equ 0004h
TACON_TMRASE_SIZE                        equ 0001h
TACON_TMRASE_LENGTH                      equ 0001h
TACON_TMRASE_MASK                        equ 0010h
TACON_TMRACS_POSN                        equ 0005h
TACON_TMRACS_POSITION                    equ 0005h
TACON_TMRACS_SIZE                        equ 0001h
TACON_TMRACS_LENGTH                      equ 0001h
TACON_TMRACS_MASK                        equ 0020h
TACON_TMRAPS0_POSN                       equ 0000h
TACON_TMRAPS0_POSITION                   equ 0000h
TACON_TMRAPS0_SIZE                       equ 0001h
TACON_TMRAPS0_LENGTH                     equ 0001h
TACON_TMRAPS0_MASK                       equ 0001h
TACON_TMRAPS1_POSN                       equ 0001h
TACON_TMRAPS1_POSITION                   equ 0001h
TACON_TMRAPS1_SIZE                       equ 0001h
TACON_TMRAPS1_LENGTH                     equ 0001h
TACON_TMRAPS1_MASK                       equ 0002h
TACON_TMRAPS2_POSN                       equ 0002h
TACON_TMRAPS2_POSITION                   equ 0002h
TACON_TMRAPS2_SIZE                       equ 0001h
TACON_TMRAPS2_LENGTH                     equ 0001h
TACON_TMRAPS2_MASK                       equ 0004h

// Register: CPSBCON0
#define CPSBCON0 CPSBCON0
CPSBCON0                                 equ 0106h
// bitfield definitions
CPSBCON0_TBXCS_POSN                      equ 0000h
CPSBCON0_TBXCS_POSITION                  equ 0000h
CPSBCON0_TBXCS_SIZE                      equ 0001h
CPSBCON0_TBXCS_LENGTH                    equ 0001h
CPSBCON0_TBXCS_MASK                      equ 0001h
CPSBCON0_CPSBOUT_POSN                    equ 0001h
CPSBCON0_CPSBOUT_POSITION                equ 0001h
CPSBCON0_CPSBOUT_SIZE                    equ 0001h
CPSBCON0_CPSBOUT_LENGTH                  equ 0001h
CPSBCON0_CPSBOUT_MASK                    equ 0002h
CPSBCON0_CPSBRNG_POSN                    equ 0002h
CPSBCON0_CPSBRNG_POSITION                equ 0002h
CPSBCON0_CPSBRNG_SIZE                    equ 0002h
CPSBCON0_CPSBRNG_LENGTH                  equ 0002h
CPSBCON0_CPSBRNG_MASK                    equ 000Ch
CPSBCON0_CPSBRM_POSN                     equ 0006h
CPSBCON0_CPSBRM_POSITION                 equ 0006h
CPSBCON0_CPSBRM_SIZE                     equ 0001h
CPSBCON0_CPSBRM_LENGTH                   equ 0001h
CPSBCON0_CPSBRM_MASK                     equ 0040h
CPSBCON0_CPSBON_POSN                     equ 0007h
CPSBCON0_CPSBON_POSITION                 equ 0007h
CPSBCON0_CPSBON_SIZE                     equ 0001h
CPSBCON0_CPSBON_LENGTH                   equ 0001h
CPSBCON0_CPSBON_MASK                     equ 0080h
CPSBCON0_CPSBRNG0_POSN                   equ 0002h
CPSBCON0_CPSBRNG0_POSITION               equ 0002h
CPSBCON0_CPSBRNG0_SIZE                   equ 0001h
CPSBCON0_CPSBRNG0_LENGTH                 equ 0001h
CPSBCON0_CPSBRNG0_MASK                   equ 0004h
CPSBCON0_CPSBRNG1_POSN                   equ 0003h
CPSBCON0_CPSBRNG1_POSITION               equ 0003h
CPSBCON0_CPSBRNG1_SIZE                   equ 0001h
CPSBCON0_CPSBRNG1_LENGTH                 equ 0001h
CPSBCON0_CPSBRNG1_MASK                   equ 0008h

// Register: CPSBCON1
#define CPSBCON1 CPSBCON1
CPSBCON1                                 equ 0107h
// bitfield definitions
CPSBCON1_CPSBCH_POSN                     equ 0000h
CPSBCON1_CPSBCH_POSITION                 equ 0000h
CPSBCON1_CPSBCH_SIZE                     equ 0004h
CPSBCON1_CPSBCH_LENGTH                   equ 0004h
CPSBCON1_CPSBCH_MASK                     equ 000Fh
CPSBCON1_CPSBCH0_POSN                    equ 0000h
CPSBCON1_CPSBCH0_POSITION                equ 0000h
CPSBCON1_CPSBCH0_SIZE                    equ 0001h
CPSBCON1_CPSBCH0_LENGTH                  equ 0001h
CPSBCON1_CPSBCH0_MASK                    equ 0001h
CPSBCON1_CPSBCH1_POSN                    equ 0001h
CPSBCON1_CPSBCH1_POSITION                equ 0001h
CPSBCON1_CPSBCH1_SIZE                    equ 0001h
CPSBCON1_CPSBCH1_LENGTH                  equ 0001h
CPSBCON1_CPSBCH1_MASK                    equ 0002h
CPSBCON1_CPSBCH2_POSN                    equ 0002h
CPSBCON1_CPSBCH2_POSITION                equ 0002h
CPSBCON1_CPSBCH2_SIZE                    equ 0001h
CPSBCON1_CPSBCH2_LENGTH                  equ 0001h
CPSBCON1_CPSBCH2_MASK                    equ 0004h
CPSBCON1_CPSBCH3_POSN                    equ 0003h
CPSBCON1_CPSBCH3_POSITION                equ 0003h
CPSBCON1_CPSBCH3_SIZE                    equ 0001h
CPSBCON1_CPSBCH3_LENGTH                  equ 0001h
CPSBCON1_CPSBCH3_MASK                    equ 0008h

