GopalSaraf/Practicals/PSDL/include/proc/pic16f707.inc
// Register: ANSELE
#define ANSELE ANSELE
ANSELE                                   equ 0189h
// bitfield definitions
ANSELE_ANSE0_POSN                        equ 0000h
ANSELE_ANSE0_POSITION                    equ 0000h
ANSELE_ANSE0_SIZE                        equ 0001h
ANSELE_ANSE0_LENGTH                      equ 0001h
ANSELE_ANSE0_MASK                        equ 0001h
ANSELE_ANSE1_POSN                        equ 0001h
ANSELE_ANSE1_POSITION                    equ 0001h
ANSELE_ANSE1_SIZE                        equ 0001h
ANSELE_ANSE1_LENGTH                      equ 0001h
ANSELE_ANSE1_MASK                        equ 0002h
ANSELE_ANSE2_POSN                        equ 0002h
ANSELE_ANSE2_POSITION                    equ 0002h
ANSELE_ANSE2_SIZE                        equ 0001h
ANSELE_ANSE2_LENGTH                      equ 0001h
ANSELE_ANSE2_MASK                        equ 0004h
ANSELE_ANSE_POSN                         equ 0000h
ANSELE_ANSE_POSITION                     equ 0000h
ANSELE_ANSE_SIZE                         equ 0008h
ANSELE_ANSE_LENGTH                       equ 0008h
ANSELE_ANSE_MASK                         equ 00FFh

// Register: PMCON1
#define PMCON1 PMCON1
PMCON1                                   equ 018Ch
// bitfield definitions
PMCON1_RD_POSN                           equ 0000h
PMCON1_RD_POSITION                       equ 0000h
PMCON1_RD_SIZE                           equ 0001h
PMCON1_RD_LENGTH                         equ 0001h
PMCON1_RD_MASK                           equ 0001h

/*
 * Bit Access Macros
 */

#ifndef PAGEMASK
#define PAGEMASK(addr) ((addr) and 07FFh)
#endif
#ifndef BANKMASK
#define BANKMASK(addr) ((addr) and 07Fh)
#endif
#define ADCS0                            BANKMASK(ADCON1), 4
#define ADCS1                            BANKMASK(ADCON1), 5
#define ADCS2                            BANKMASK(ADCON1), 6
#define ADDEN                            BANKMASK(RCSTA), 3
#define ADFVR0                           BANKMASK(FVRCON), 0
#define ADFVR1                           BANKMASK(FVRCON), 1
#define ADIE                             BANKMASK(PIE1), 6
#define ADIF                             BANKMASK(PIR1), 6
#define ADON                             BANKMASK(ADCON0), 0
#define ADREF0                           BANKMASK(ADCON1), 0
#define ADREF1                           BANKMASK(ADCON1), 1
#define AN0                              BANKMASK(PORTA), 0
#define AN1                              BANKMASK(PORTA), 1
#define AN10                             BANKMASK(PORTB), 1
#define AN11                             BANKMASK(PORTB), 4
#define AN12                             BANKMASK(PORTB), 0
#define AN13                             BANKMASK(PORTB), 5
#define AN2                              BANKMASK(PORTA), 2
#define AN3                              BANKMASK(PORTA), 3
#define AN4                              BANKMASK(PORTA), 5
#define AN5                              BANKMASK(PORTE), 0
#define AN6                              BANKMASK(PORTE), 1
#define AN7                              BANKMASK(PORTE), 2
#define AN8                              BANKMASK(PORTB), 2
#define AN9                              BANKMASK(PORTB), 3
#define ANSA0                            BANKMASK(ANSELA), 0
#define ANSA1                            BANKMASK(ANSELA), 1
#define ANSA2                            BANKMASK(ANSELA), 2
#define ANSA3                            BANKMASK(ANSELA), 3
#define ANSA4                            BANKMASK(ANSELA), 4
#define ANSA5                            BANKMASK(ANSELA), 5
#define ANSA6                            BANKMASK(ANSELA), 6
#define ANSA7                            BANKMASK(ANSELA), 7
#define ANSB0                            BANKMASK(ANSELB), 0
#define ANSB1                            BANKMASK(ANSELB), 1
#define ANSB2                            BANKMASK(ANSELB), 2
#define ANSB3                            BANKMASK(ANSELB), 3
#define ANSB4                            BANKMASK(ANSELB), 4
#define ANSB5                            BANKMASK(ANSELB), 5
#define ANSB6                            BANKMASK(ANSELB), 6
#define ANSB7                            BANKMASK(ANSELB), 7
#define ANSC0                            BANKMASK(ANSELC), 0
#define ANSC1                            BANKMASK(ANSELC), 1
#define ANSC2                            BANKMASK(ANSELC), 2
#define ANSC5                            BANKMASK(ANSELC), 5
#define ANSC6                            BANKMASK(ANSELC), 6
#define ANSC7                            BANKMASK(ANSELC), 7
#define ANSD0                            BANKMASK(ANSELD), 0
#define ANSD1                            BANKMASK(ANSELD), 1
#define ANSD2                            BANKMASK(ANSELD), 2
#define ANSD3                            BANKMASK(ANSELD), 3
#define ANSD4                            BANKMASK(ANSELD), 4
#define ANSD5                            BANKMASK(ANSELD), 5
#define ANSD6                            BANKMASK(ANSELD), 6
#define ANSD7                            BANKMASK(ANSELD), 7
#define ANSE0                            BANKMASK(ANSELE), 0
#define ANSE1                            BANKMASK(ANSELE), 1
#define ANSE2                            BANKMASK(ANSELE), 2
#define BF                               BANKMASK(SSPSTAT), 0
#define BRGH                             BANKMASK(TXSTA), 2
#define CARRY                            BANKMASK(STATUS), 0
#define CCP1                             BANKMASK(PORTC), 2
#define CCP1IE                           BANKMASK(PIE1), 2
#define CCP1IF                           BANKMASK(PIR1), 2
#define CCP1M0                           BANKMASK(CCP1CON), 0
#define CCP1M1                           BANKMASK(CCP1CON), 1
#define CCP1M2                           BANKMASK(CCP1CON), 2
#define CCP1M3                           BANKMASK(CCP1CON), 3
#define CCP2IE                           BANKMASK(PIE2), 0
#define CCP2IF                           BANKMASK(PIR2), 0
#define CCP2M0                           BANKMASK(CCP2CON), 0
#define CCP2M1                           BANKMASK(CCP2CON), 1
#define CCP2M2                           BANKMASK(CCP2CON), 2
#define CCP2M3                           BANKMASK(CCP2CON), 3
#define CCP2SEL                          BANKMASK(APFCON), 0
#define CDAFVR0                          BANKMASK(FVRCON), 2
#define CDAFVR1                          BANKMASK(FVRCON), 3
#define CHS0                             BANKMASK(ADCON0), 2
#define CHS1                             BANKMASK(ADCON0), 3
#define CHS2                             BANKMASK(ADCON0), 4
#define CHS3                             BANKMASK(ADCON0), 5
#define CK                               BANKMASK(PORTC), 6
#define CKE                              BANKMASK(SSPSTAT), 6
#define CKP                              BANKMASK(SSPCON), 4
#define CLKIN                            BANKMASK(PORTA), 7
#define CLKOUT                           BANKMASK(PORTA), 6
#define CPSA0                            BANKMASK(PORTA), 1
#define CPSA1                            BANKMASK(PORTA), 2
#define CPSA10                           BANKMASK(PORTC), 6
#define CPSA11                           BANKMASK(PORTC), 7
#define CPSA12                           BANKMASK(PORTD), 4
#define CPSA13                           BANKMASK(PORTD), 5
#define CPSA14                           BANKMASK(PORTD), 6
#define CPSA15                           BANKMASK(PORTD), 7
#define CPSA2                            BANKMASK(PORTA), 3
#define CPSA3                            BANKMASK(PORTA), 4
#define CPSA4                            BANKMASK(PORTA), 5
#define CPSA5                            BANKMASK(PORTE), 0
#define CPSA6                            BANKMASK(PORTE), 1
#define CPSA7                            BANKMASK(PORTE), 2
#define CPSA8                            BANKMASK(PORTD), 3
#define CPSA9                            BANKMASK(PORTC), 5
#define CPSACH0                          BANKMASK(CPSACON1), 0
#define CPSACH1                          BANKMASK(CPSACON1), 1
#define CPSACH2                          BANKMASK(CPSACON1), 2
#define CPSACH3                          BANKMASK(CPSACON1), 3
#define CPSAON                           BANKMASK(CPSACON0), 7
#define CPSAOUT                          BANKMASK(CPSACON0), 1
#define CPSARM                           BANKMASK(CPSACON0), 6
#define CPSARNG0                         BANKMASK(CPSACON0), 2
#define CPSARNG1                         BANKMASK(CPSACON0), 3
#define CPSB0                            BANKMASK(PORTA), 7
#define CPSB1                            BANKMASK(PORTA), 6
#define CPSB10                           BANKMASK(PORTB), 2
#define CPSB11                           BANKMASK(PORTB), 3
#define CPSB12                           BANKMASK(PORTB), 4
#define CPSB13                           BANKMASK(PORTB), 5
#define CPSB14                           BANKMASK(PORTB), 6
#define CPSB15                           BANKMASK(PORTB), 7
#define CPSB2                            BANKMASK(PORTC), 0
#define CPSB3                            BANKMASK(PORTC), 1
#define CPSB4                            BANKMASK(PORTC), 2
#define CPSB5                            BANKMASK(PORTD), 0
#define CPSB6                            BANKMASK(PORTD), 1
#define CPSB7                            BANKMASK(PORTD), 2
#define CPSB8                            BANKMASK(PORTB), 0
#define CPSB9                            BANKMASK(PORTB), 1
#define CPSBCH0                          BANKMASK(CPSBCON1), 0
#define CPSBCH1                          BANKMASK(CPSBCON1), 1
#define CPSBCH2                          BANKMASK(CPSBCON1), 2
#define CPSBCH3                          BANKMASK(CPSBCON1), 3
#define CPSBON                           BANKMASK(CPSBCON0), 7
#define CPSBOUT                          BANKMASK(CPSBCON0), 1
#define CPSBRM                           BANKMASK(CPSBCON0), 6
#define CPSBRNG0                         BANKMASK(CPSBCON0), 2
#define CPSBRNG1                         BANKMASK(CPSBCON0), 3
#define CREN                             BANKMASK(RCSTA), 4
#define CSRC                             BANKMASK(TXSTA), 7
#define DACEN                            BANKMASK(DACCON0), 7
#define DACLPS                           BANKMASK(DACCON0), 6
#define DACOE                            BANKMASK(DACCON0), 5
#define DACOUT                           BANKMASK(PORTA), 2
#define DACPSS0                          BANKMASK(DACCON0), 2
#define DACPSS1                          BANKMASK(DACCON0), 3
#define DACR0                            BANKMASK(DACCON1), 0
#define DACR1                            BANKMASK(DACCON1), 1
#define DACR2                            BANKMASK(DACCON1), 2
#define DACR3                            BANKMASK(DACCON1), 3
#define DACR4                            BANKMASK(DACCON1), 4
#define DC                               BANKMASK(STATUS), 1
#define DC1B0                            BANKMASK(CCP1CON), 4
#define DC1B1                            BANKMASK(CCP1CON), 5
#define DC2B0                            BANKMASK(CCP2CON), 4
#define DC2B1                            BANKMASK(CCP2CON), 5
#define DT                               BANKMASK(PORTC), 7
#define D_nA                             BANKMASK(SSPSTAT), 5
#define FERR                             BANKMASK(RCSTA), 2
#define FVREN                            BANKMASK(FVRCON), 6
#define FVRRDY                           BANKMASK(FVRCON), 7
#define GIE                              BANKMASK(INTCON), 7
#define GO_nDONE                         BANKMASK(ADCON0), 1
#define ICSL                             BANKMASK(OSCCON), 3
#define ICSS                             BANKMASK(OSCCON), 2
#define INTE                             BANKMASK(INTCON), 4
#define INTEDG                           BANKMASK(OPTION_REG), 6
#define INTF                             BANKMASK(INTCON), 1
#define IOCB0                            BANKMASK(IOCB), 0
#define IOCB1                            BANKMASK(IOCB), 1
#define IOCB2                            BANKMASK(IOCB), 2
#define IOCB3                            BANKMASK(IOCB), 3
#define IOCB4                            BANKMASK(IOCB), 4
#define IOCB5                            BANKMASK(IOCB), 5
#define IOCB6                            BANKMASK(IOCB), 6
#define IOCB7                            BANKMASK(IOCB), 7
#define IRCF0                            BANKMASK(OSCCON), 4
#define IRCF1                            BANKMASK(OSCCON), 5
#define OERR                             BANKMASK(RCSTA), 1
#define OSC1                             BANKMASK(PORTA), 7
#define OSC2                             BANKMASK(PORTA), 6
#define PEIE                             BANKMASK(INTCON), 6
#define PS0                              BANKMASK(OPTION_REG), 0
#define PS1                              BANKMASK(OPTION_REG), 1
#define PS2                              BANKMASK(OPTION_REG), 2
#define PSA                              BANKMASK(OPTION_REG), 3
#define RA0                              BANKMASK(PORTA), 0
#define RA1                              BANKMASK(PORTA), 1
#define RA2                              BANKMASK(PORTA), 2
#define RA3                              BANKMASK(PORTA), 3
#define RA4                              BANKMASK(PORTA), 4
#define RA5                              BANKMASK(PORTA), 5
#define RA6                              BANKMASK(PORTA), 6
#define RA7                              BANKMASK(PORTA), 7
#define RB0                              BANKMASK(PORTB), 0
#define RB1                              BANKMASK(PORTB), 1
#define RB2                              BANKMASK(PORTB), 2
#define RB3                              BANKMASK(PORTB), 3
#define RB4                              BANKMASK(PORTB), 4
#define RB5                              BANKMASK(PORTB), 5
#define RB6                              BANKMASK(PORTB), 6
#define RB7                              BANKMASK(PORTB), 7
#define RBIE                             BANKMASK(INTCON), 3
#define RBIF                             BANKMASK(INTCON), 0
#define RC0                              BANKMASK(PORTC), 0
#define RC1                              BANKMASK(PORTC), 1
#define RC2                              BANKMASK(PORTC), 2
#define RC3                              BANKMASK(PORTC), 3
#define RC4                              BANKMASK(PORTC), 4
#define RC5                              BANKMASK(PORTC), 5
#define RC6                              BANKMASK(PORTC), 6
#define RC7                              BANKMASK(PORTC), 7
#define RCIE                             BANKMASK(PIE1), 5
#define RCIF                             BANKMASK(PIR1), 5
#define RD                               BANKMASK(PMCON1), 0
#define RD0                              BANKMASK(PORTD), 0
#define RD1                              BANKMASK(PORTD), 1
#define RD2                              BANKMASK(PORTD), 2
#define RD3                              BANKMASK(PORTD), 3
#define RD4                              BANKMASK(PORTD), 4
#define RD5                              BANKMASK(PORTD), 5
#define RD6                              BANKMASK(PORTD), 6
#define RD7                              BANKMASK(PORTD), 7
#define RE0                              BANKMASK(PORTE), 0
#define RE1                              BANKMASK(PORTE), 1
#define RE2                              BANKMASK(PORTE), 2
#define RE3                              BANKMASK(PORTE), 3
#define RP0                              BANKMASK(STATUS), 5
#define RP1                              BANKMASK(STATUS), 6
#define RX                               BANKMASK(PORTC), 7
#define RX9                              BANKMASK(RCSTA), 6
#define RX9D                             BANKMASK(RCSTA), 0
#define R_nW                             BANKMASK(SSPSTAT), 2
#define SCK                              BANKMASK(PORTC), 3
#define SCL                              BANKMASK(PORTC), 3
#define SDA                              BANKMASK(PORTC), 4
#define SDI                              BANKMASK(PORTC), 4
#define SDO                              BANKMASK(PORTC), 5
#define SMP                              BANKMASK(SSPSTAT), 7
#define SPEN                             BANKMASK(RCSTA), 7
#define SREN                             BANKMASK(RCSTA), 5
#define SSPEN                            BANKMASK(SSPCON), 5
#define SSPIE                            BANKMASK(PIE1), 3
#define SSPIF                            BANKMASK(PIR1), 3
#define SSPM0                            BANKMASK(SSPCON), 0
#define SSPM1                            BANKMASK(SSPCON), 1
#define SSPM2                            BANKMASK(SSPCON), 2
#define SSPM3                            BANKMASK(SSPCON), 3
#define SSPOV                            BANKMASK(SSPCON), 6
#define SSSEL                            BANKMASK(APFCON), 1
#define SYNC                             BANKMASK(TXSTA), 4
#define T0CKI                            BANKMASK(PORTA), 4
#define T0CS                             BANKMASK(OPTION_REG), 5
#define T0IE                             BANKMASK(INTCON), 5
#define T0IF                             BANKMASK(INTCON), 2
#define T0SE                             BANKMASK(OPTION_REG), 4
#define T1CKI                            BANKMASK(PORTC), 0
#define T1CKPS0                          BANKMASK(T1CON), 4
#define T1CKPS1                          BANKMASK(T1CON), 5
#define T1G                              BANKMASK(PORTB), 5
#define T1GGO_nDONE                      BANKMASK(T1GCON), 3
#define T1GPOL                           BANKMASK(T1GCON), 6
#define T1GSPM                           BANKMASK(T1GCON), 4
#define T1GSS0                           BANKMASK(T1GCON), 0
#define T1GSS1                           BANKMASK(T1GCON), 1
#define T1GTM                            BANKMASK(T1GCON), 5
#define T1GVAL                           BANKMASK(T1GCON), 2
#define T1OSCEN                          BANKMASK(T1CON), 3
#define T1OSI                            BANKMASK(PORTC), 1
#define T1OSO                            BANKMASK(PORTC), 0
#define T1SYNC                           BANKMASK(T1CON), 2
#define T2CKPS0                          BANKMASK(T2CON), 0
#define T2CKPS1                          BANKMASK(T2CON), 1
#define T3CKI                            BANKMASK(PORTB), 5
#define T3CKPS0                          BANKMASK(T3CON), 4
#define T3CKPS1                          BANKMASK(T3CON), 5
#define T3G                              BANKMASK(PORTD), 0
#define T3GGO_nDONE                      BANKMASK(T3GCON), 3
#define T3GPOL                           BANKMASK(T3GCON), 6
#define T3GSPM                           BANKMASK(T3GCON), 4
#define T3GSS0                           BANKMASK(T3GCON), 0
#define T3GSS1                           BANKMASK(T3GCON), 1
#define T3GTM                            BANKMASK(T3GCON), 5
#define T3GVAL                           BANKMASK(T3GCON), 2
#define T3SYNC                           BANKMASK(T3CON), 2
#define TACKI                            BANKMASK(PORTA), 4
#define TACS                             BANKMASK(TACON), 5
#define TAPS0                            BANKMASK(TACON), 0
#define TAPS1                            BANKMASK(TACON), 1
#define TAPS2                            BANKMASK(TACON), 2
#define TAPSA                            BANKMASK(TACON), 3
#define TASE                             BANKMASK(TACON), 4
#define TAXCS                            BANKMASK(CPSACON0), 0
#define TBCKI                            BANKMASK(PORTC), 2
#define TBCS                             BANKMASK(TBCON), 5
#define TBPS0                            BANKMASK(TBCON), 0
#define TBPS1                            BANKMASK(TBCON), 1
#define TBPS2                            BANKMASK(TBCON), 2
#define TBPSA                            BANKMASK(TBCON), 3
#define TBSE                             BANKMASK(TBCON), 4
#define TBXCS                            BANKMASK(CPSBCON0), 0
#define TMR0CS                           BANKMASK(OPTION_REG), 5
#define TMR0IE                           BANKMASK(INTCON), 5
#define TMR0IF                           BANKMASK(INTCON), 2
#define TMR0SE                           BANKMASK(OPTION_REG), 4
#define TMR1CS0                          BANKMASK(T1CON), 6
#define TMR1CS1                          BANKMASK(T1CON), 7
#define TMR1GE                           BANKMASK(T1GCON), 7
#define TMR1GIE                          BANKMASK(PIE1), 7
#define TMR1GIF                          BANKMASK(PIR1), 7
#define TMR1IE                           BANKMASK(PIE1), 0
#define TMR1IF                           BANKMASK(PIR1), 0
#define TMR1ON                           BANKMASK(T1CON), 0
#define TMR2IE                           BANKMASK(PIE1), 1
#define TMR2IF                           BANKMASK(PIR1), 1
#define TMR2ON                           BANKMASK(T2CON), 2
#define TMR3CS0                          BANKMASK(T3CON), 6
#define TMR3CS1                          BANKMASK(T3CON), 7
#define TMR3GE                           BANKMASK(T3GCON), 7
#define TMR3GIE                          BANKMASK(PIE2), 7
#define TMR3GIF                          BANKMASK(PIR2), 7
#define TMR3IE                           BANKMASK(PIE2), 6
#define TMR3IF                           BANKMASK(PIR2), 6
#define TMR3ON                           BANKMASK(T3CON), 0
#define TMRACS                           BANKMASK(TACON), 5
#define TMRAIE                           BANKMASK(PIE2), 4
#define TMRAIF                           BANKMASK(PIR2), 4
#define TMRAON                           BANKMASK(TACON), 7
#define TMRAPS0                          BANKMASK(TACON), 0
#define TMRAPS1                          BANKMASK(TACON), 1
#define TMRAPS2                          BANKMASK(TACON), 2
#define TMRAPSA                          BANKMASK(TACON), 3
#define TMRASE                           BANKMASK(TACON), 4
#define TMRBCS                           BANKMASK(TBCON), 5
#define TMRBIE                           BANKMASK(PIE2), 5
#define TMRBIF                           BANKMASK(PIR2), 5
#define TMRBON                           BANKMASK(TBCON), 7
#define TMRBPS0                          BANKMASK(TBCON), 0
#define TMRBPS1                          BANKMASK(TBCON), 1
#define TMRBPS2                          BANKMASK(TBCON), 2
#define TMRBPSA                          BANKMASK(TBCON), 3
#define TMRBSE                           BANKMASK(TBCON), 4
#define TMRCS0                           BANKMASK(T1CON), 6
#define TMRCS1                           BANKMASK(T1CON), 7
#define TOUTPS0                          BANKMASK(T2CON), 3
#define TOUTPS1                          BANKMASK(T2CON), 4
#define TOUTPS2                          BANKMASK(T2CON), 5
#define TOUTPS3                          BANKMASK(T2CON), 6
#define TRISA0                           BANKMASK(TRISA), 0
#define TRISA1                           BANKMASK(TRISA), 1
#define TRISA2                           BANKMASK(TRISA), 2
#define TRISA3                           BANKMASK(TRISA), 3
#define TRISA4                           BANKMASK(TRISA), 4
#define TRISA5                           BANKMASK(TRISA), 5
#define TRISA6                           BANKMASK(TRISA), 6
#define TRISA7                           BANKMASK(TRISA), 7
#define TRISB0                           BANKMASK(TRISB), 0
#define TRISB1                           BANKMASK(TRISB), 1
#define TRISB2                           BANKMASK(TRISB), 2
#define TRISB3                           BANKMASK(TRISB), 3
#define TRISB4                           BANKMASK(TRISB), 4
#define TRISB5                           BANKMASK(TRISB), 5
#define TRISB6                           BANKMASK(TRISB), 6
#define TRISB7                           BANKMASK(TRISB), 7
#define TRISC0                           BANKMASK(TRISC), 0
#define TRISC1                           BANKMASK(TRISC), 1
#define TRISC2                           BANKMASK(TRISC), 2
#define TRISC3                           BANKMASK(TRISC), 3
#define TRISC4                           BANKMASK(TRISC), 4
#define TRISC5                           BANKMASK(TRISC), 5
